# **TITANIC DATASET FROM KAGGLE :**

In [ ]:
import pandas as pd
import numpy as np
%matplotlib inline
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn import metrics
from sklearn.metrics import confusion_matrix
from sklearn.metrics import accuracy_score

In [ ]:
Data=pd.read_csv('/content/Titanic Dataset.csv')

In [ ]:
Data.shape

(418, 13)

In [ ]:
Data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'Unnamed: 12'],
      dtype='object')

In [ ]:
Data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare,Unnamed: 12
count,418.000000,418.000000,418.000000,332.000000,418.000000,418.000000,417.000000,0.0
mean,1100.500000,0.363636,2.265550,30.272590,0.447368,0.392344,35.627188,NaN
std,120.810458,0.481622,0.841838,14.181209,0.896760,0.981429,55.907576,NaN
min,892.000000,0.000000,1.000000,0.170000,0.000000,0.000000,0.000000,NaN
25%,996.250000,0.000000,1.000000,21.000000,0.000000,0.000000,7.895800,NaN
50%,1100.500000,0.000000,3.000000,27.000000,0.000000,0.000000,14.454200,NaN
75%,1204.750000,1.000000,3.000000,39.000000,1.000000,0.000000,31.500000,NaN
max,1309.000000,1.000000,3.000000,76.000000,8.000000,9.000000,512.329200,NaN

In [ ]:
Data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
 12  Unnamed: 12  0 non-null      float64
dtypes: float64(3), int64(5), object(5)
memory usage: 42.6+ KB

In [ ]:
Data.isnull().any()

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare            True
Cabin           True
Embarked       False
Unnamed: 12     True
dtype: bool

In [ ]:
Data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
Unnamed: 12    418
dtype: int64

In [ ]:
data=Data.drop(['Cabin','Unnamed: 12','Name'],axis=1)

In [ ]:
data

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,892,0,3,male,34.5,0,0,330911,7.8292,Q
1,893,1,3,female,47.0,1,0,363272,7.0000,S
2,894,0,2,male,62.0,0,0,240276,9.6875,Q
3,895,0,3,male,27.0,0,0,315154,8.6625,S
4,896,1,3,female,22.0,1,1,3101298,12.2875,S
...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,male,NaN,0,0,A.5. 3236,8.0500,S
414,1306,1,1,female,39.0,0,0,PC 17758,108.9000,C
415,1307,0,3,male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,S
416,1308,0,3,male,NaN,0,0,359309,8.0500,S
417,1309,0,3,male,NaN,1,1,2668,22.3583,C

In [ ]:
data['Age'].fillna(0,inplace=True)

In [ ]:
data['Fare'].fillna(0,inplace=True)

In [ ]:
data.isnull().any()

PassengerId    False
Survived       False
Pclass         False
Sex            False
Age            False
SibSp          False
Parch          False
Ticket         False
Fare           False
Embarked       False
dtype: bool